cask_args appdir: '/Applications'

##############################
#           DEV
##############################

# tap
tap "homebrew/bundle"
tap "hashicorp/tap"

# formula
brew "ack"
brew "coreutils"
brew "asdf"
brew "curl"
brew "gawk"
brew "gh"
brew "git"
brew "jq"
brew "yq"
brew "kustomize"
brew "tree"
brew "wget"
brew "gnupg"
brew "wxwidgets"
brew "libxslt"
brew "fop"
brew "telnet"

# cask

cask "google-chrome"
cask "firefox"
cask "visual-studio-code"
cask "aws-vault"
cask "iterm2"
cask "raycast"



# vscode extension
vscode "4ops.terraform"
vscode "alefragnani.project-manager"
vscode "bierner.markdown-mermaid"
vscode "codezombiech.gitignore"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "formulahendry.docker-explorer"
vscode "formulahendry.docker-extension-pack"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "jakebecker.elixir-ls"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "run-at-scale.terraform-doc-snippets"
vscode "saratravi.elixir-formatter"
vscode "takumii.markdowntable"
vscode "wekex.jsonlint"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "ziyasal.vscode-open-in-github"
vscode "editorconfig.editorconfig"


##############################
#           OTHER
##############################

# formula
brew "mas"

# cask
cask "wechat"
cask "orbstack"
cask "rustdesk"
cask "stats"
cask "firefox"
cask "mitmproxy"
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "appcleaner"

# mas
mas "辞書 by 物書堂", id: 1_380_563_956
