cask_args appdir: '/Applications'

# tap
tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"

# 
# dev
# 

# formula
brew "ack"
brew "coreutils"
brew "curl"
brew "gawk"
brew "git"
brew "gh"
brew "jq"
brew "yq"
brew "kustomize"
brew "tree"
brew "wget"
brew "gnupg"
brew "wxwidgets"
brew "libxslt"
brew "fop"
brew "telnet"
brew "mise"
brew "helm"

# cask
cask "google-chrome"
cask "firefox"
cask "visual-studio-code"
cask "aws-vault"
cask "iterm2"
cask "raycast"
cask "orbstack"
cask "font-fira-code"
cask "slack"
cask "tableplus"
cask "chatgpt"


# 
# others
#

# formula
brew "mas"

# cask
cask "wechat"
cask "rustdesk"
cask "stats"
cask "firefox"
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-powerpoint"
cask "microsoft-remote-desktop"
cask "appcleaner"

# mas
mas "辞書 by 物書堂", id: 1_380_563_956
mas "LINE", id: 539_883_307
