cask_args appdir: '/Applications'

tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "tako8ki/tap"

brew "ack"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "readline"
brew "cmake"
brew "coreutils"
brew "curl"
brew "fop"
brew "gawk"
brew "gh"
brew "git"
brew "gnupg"
brew "helm"
brew "htop"
brew "jq"
brew "kustomize"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "mas"
brew "mise"
brew "telnet"
brew "tree"
brew "unixodbc"
brew "wget"
brew "wxwidgets"
brew "yq"
brew "cobra-cli"

cask "appcleaner"
cask "aws-vault"
cask "chatgpt"
cask "firefox" 
cask "font-fira-code"
cask "google-chrome" 
cask "iterm2"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-word"
cask "windows-app"
cask "raycast"
cask "stats"
cask "orbstack"
cask "postman"
cask "tableplus"
cask "visual-studio-code"
cask "rustdesk" 
cask "spotify"
cask "slack"
cask "wechat"
cask "qq"

mas "Dictionaries", id: 1380563956
mas "LINE", id: 539883307
mas "Xcode", id: 497799835
